### Labor market situation for young people (15 to 27 years); region (classification 2017)

In [2]:
import pandas as pd
import requests
import json
from pandas.io.json import json_normalize

This table contains information on the regional labor market situation of all young people aged 15 to 27 in the Netherlands who were registered in the Basic Persons Registration (BRP) on 1 October of the reference year. It indicates whether young people work, whether they go to school, whether they receive a benefit and whether they are registered as a job-seeker with the UWV Werkbedrijf. For the active young people, a distinction is made between employees and the self-employed. This table also includes all benefits in the context of social security relating to incapacity for work, sickness, unemployment or assistance. The total number of young people (15 to 27 years) with a benefit within this table is higher than in other StatLine tables on social security.

The reporting period is the month of October of the reference year. Whether someone goes to school is determined on the basis of a registration in the government-funded education on 1 October of the reference year.

The municipalities are classified according to the situation on 1 January 2017.

Data available from 2005 up to and including 2016. The figures relate to the situation in October of the relevant year.

Status of the figures: The figures for the years 2005 up to and including 2015 in this table are definitive. The figures for 2016 are provisional.

Changes as of April 18, 2018: In the previous version the region "West Netherlands, excluding G4" was wrongly included. This region has been removed in this version.

Changes as of April 12, 2018: None, this is a new table.

When will new figures arrive? The figures for 2017 will be published in spring 2019 in a new table with the regional classification of 2018.

[Open Data Source](https://data.overheid.nl/data/dataset/arbeidsmarktsituatie-jongeren-15-tot-27-jaar-regio-indeling-2017-)  
[License](https://data.overheid.nl/licenties-voor-hergebruik) CC-BY 4.0

In [5]:
request = requests.get("https://opendata.cbs.nl/ODataApi/OData/83969NED")

In [7]:
for line in json.loads(request.text)['value']:
    print(line)

{'url': 'http://opendata.cbs.nl/ODataApi/OData/83969NED/TableInfos', 'name': 'TableInfos'}
{'url': 'http://opendata.cbs.nl/ODataApi/OData/83969NED/UntypedDataSet', 'name': 'UntypedDataSet'}
{'url': 'http://opendata.cbs.nl/ODataApi/OData/83969NED/TypedDataSet', 'name': 'TypedDataSet'}
{'url': 'http://opendata.cbs.nl/ODataApi/OData/83969NED/DataProperties', 'name': 'DataProperties'}
{'url': 'http://opendata.cbs.nl/ODataApi/OData/83969NED/CategoryGroups', 'name': 'CategoryGroups'}
{'url': 'http://opendata.cbs.nl/ODataApi/OData/83969NED/Onderwijsdeelname', 'name': 'Onderwijsdeelname'}
{'url': 'http://opendata.cbs.nl/ODataApi/OData/83969NED/KenmerkenArbeid', 'name': 'KenmerkenArbeid'}
{'url': 'http://opendata.cbs.nl/ODataApi/OData/83969NED/Uitkering', 'name': 'Uitkering'}
{'url': 'http://opendata.cbs.nl/ODataApi/OData/83969NED/IngeschrevenUWVWerkbedrijf', 'name': 'IngeschrevenUWVWerkbedrijf'}
{'url': 'http://opendata.cbs.nl/ODataApi/OData/83969NED/RegioS', 'name': 'RegioS'}
{'url': 'http://opendata.cbs.nl/ODataApi/OData/83969NED/Perioden', 'name': 'Perioden'}

In [8]:
request = requests.get('http://opendata.cbs.nl/ODataApi/OData/83969NED/CategoryGroups')
table = json_normalize(json.loads(request.text)['value'])

In [9]:
table

,Description,DimensionKey,ID,ParentID,Title
0,NA,KenmerkenArbeid,0,NaN,Totaal
1,None,KenmerkenArbeid,1,0.0,Totaal
2,,KenmerkenArbeid,2,0.0,Arbeidspositie
3,Indeling van de werkzame beroepsbevolking naar...,KenmerkenArbeid,3,0.0,Positie in de werkkring

In [14]:
request1 = requests.get('http://opendata.cbs.nl/ODataApi/OData/83969NED/DataProperties')
table1 = json_normalize(json.loads(request1.text)['value'])

In [15]:
table1

,Datatype,Decimals,Default,Description,ID,Key,MapYear,ParentID,Position,PresentationType,ReleasePolicy,Title,Type,Unit,odata.type
0,NaN,NaN,NaN,,0,Onderwijsdeelname,NaN,None,0,NaN,NaN,Onderwijsdeelname,Dimension,NaN,Cbs.OData.Dimension
1,NaN,NaN,NaN,,1,KenmerkenArbeid,NaN,None,1,NaN,NaN,Kenmerken arbeid,Dimension,NaN,Cbs.OData.Dimension
2,NaN,NaN,NaN,,2,Uitkering,NaN,None,2,NaN,NaN,Uitkering,Dimension,NaN,Cbs.OData.Dimension
3,NaN,NaN,NaN,,3,IngeschrevenUWVWerkbedrijf,NaN,None,3,NaN,NaN,Ingeschreven UWV werkbedrijf,Dimension,NaN,Cbs.OData.Dimension
4,NaN,NaN,NaN,,4,RegioS,2017.0,None,4,NaN,NaN,Regio's,GeoDimension,NaN,Cbs.OData.GeoDimension
5,NaN,NaN,NaN,,5,Perioden,NaN,None,5,NaN,True,Perioden,TimeDimension,NaN,Cbs.OData.TimeDimension
6,Long,0.0,Missing,Aantal jongeren dat in Nederland woont.\r\n\r\...,6,Jongeren15Tot27Jaar_1,NaN,None,6,Absolute,NaN,Jongeren (15 tot 27 jaar),Topic,aantal,Cbs.OData.Topic

In [16]:
request2 = requests.get('http://opendata.cbs.nl/ODataApi/OData/83969NED/Onderwijsdeelname')
table2 = json_normalize(json.loads(request2.text)['value'])

In [108]:
table2.to_csv('Onderwijsdeelname.csv')

In [18]:
request3 = requests.get('http://opendata.cbs.nl/ODataApi/OData/83969NED/KenmerkenArbeid')
table3 = json_normalize(json.loads(request3.text)['value'])

In [109]:
table3.to_csv('KenmerkenArbeid.csv')

In [20]:
request4 = requests.get('http://opendata.cbs.nl/ODataApi/OData/83969NED/Uitkering')
table4 = json_normalize(json.loads(request4.text)['value'])

In [110]:
table4.to_csv('Uitkering.csv')

In [24]:
request5 = requests.get('http://opendata.cbs.nl/ODataApi/OData/83969NED/IngeschrevenUWVWerkbedrijf')
table5 = json_normalize(json.loads(request5.text)['value'])

In [111]:
table5.to_csv('IngeschrevenUWVWerkbedrijf.csv')

In [26]:
request6 = requests.get('http://opendata.cbs.nl/ODataApi/OData/83969NED/RegioS')
table6 = json_normalize(json.loads(request6.text)['value'])

In [112]:
table6.to_csv('RegioS.csv')

In [29]:
request7 = requests.get('http://opendata.cbs.nl/ODataApi/OData/83969NED/Perioden')
table7 = json_normalize(json.loads(request7.text)['value'])

In [113]:
table7.to_csv('Perioden.csv')

In [36]:
table0 = pd.read_csv('labor-market-netherlands.csv', sep =';', index_col=False)

/Users/pedrohserrano/anaconda3/envs/py35r/lib/python3.5/site-packages/IPython/core/interactiveshell.py:2728: DtypeWarning: Columns (1,2,3) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [38]:
table0.head()

,ID,Participation in education,features Work,Payment,Signed CWI,REGIOS,The period,Youth 15 to 27 Years
0,0,T001144,T001095,T000000,T001266,NL01,2005JJ00,2351600
1,1,T001144,T001095,T000000,T001266,NL01,2006JJ00,2363600
2,2,T001144,T001095,T000000,T001266,NL01,2007JJ00,2374000
3,3,T001144,T001095,T000000,T001266,NL01,2008JJ00,2392100
4,4,T001144,T001095,T000000,T001266,NL01,2009JJ00,2418600

In [40]:
merged_1 = pd.merge(table0, table2, left_on='Participation in education', right_on= 'Key', how='left')

In [43]:
merged_2 = pd.merge(merged_1, table3, left_on='features Work', right_on= 'Key', how='left')

In [45]:
merged_3 = pd.merge(merged_2, table4, left_on='Payment', right_on= 'Key', how='left')

In [47]:
merged_4 = pd.merge(merged_3, table5, left_on='Signed CWI', right_on= 'Key', how='left')

In [49]:
merged_5 = pd.merge(merged_4, table6, left_on='REGIOS', right_on= 'Key', how='left')

In [51]:
merged_6 = pd.merge(merged_5, table7, left_on='The period', right_on= 'Key', how='left')

In [56]:
merged_6.head()#.columns

,ID,Participation in education,features Work,Payment,Signed CWI,REGIOS,The period,Youth 15 to 27 Years,CategoryGroupID_x,Description_x,...,Key_y,Title_y,CategoryGroupID,Description_x,Key_x,Title_x,Description_y,Key_y,Status,Title_y
0,0,T001144,T001095,T000000,T001266,NL01,2005JJ00,2351600,None,,...,T001266,Totaal,None,,NL01,Nederland,,2005JJ00,Definitief,2005
1,1,T001144,T001095,T000000,T001266,NL01,2006JJ00,2363600,None,,...,T001266,Totaal,None,,NL01,Nederland,None,2006JJ00,Definitief,2006
2,2,T001144,T001095,T000000,T001266,NL01,2007JJ00,2374000,None,,...,T001266,Totaal,None,,NL01,Nederland,,2007JJ00,Definitief,2007
3,3,T001144,T001095,T000000,T001266,NL01,2008JJ00,2392100,None,,...,T001266,Totaal,None,,NL01,Nederland,,2008JJ00,Definitief,2008
4,4,T001144,T001095,T000000,T001266,NL01,2009JJ00,2418600,None,,...,T001266,Totaal,None,,NL01,Nederland,,2009JJ00,Definitief,2009

In [61]:
merged_6.columns = ['ID', 'Participation in education key', 'features Work key', 'Payment key',
       'Signed CWI key', 'REGIOS key', 'The period key', 'Youth 15 to 27 Years',
       'CategoryGroupID_1', 'Description_1', 'Key_1', 'Participation in education',
       'CategoryGroupID_2', 'Description_2', 'Key_2', 'Work Characteristics',
       'CategoryGroupID_3', 'Description_3', 'Key_3', 'Payment',
       'CategoryGroupID_4', 'Description_4', 'Key_4', 'Signed UW',
       'CategoryGroupID_5', 'Description_5', 'Key_5', 'Region', 'Description_6',
       'Key_6', 'Status', 'Period']

In [92]:
data_merged = merged_6[['ID','Work Characteristics','Payment','Signed UW','Region','Period']]

In [93]:
data_filtered = data_merged[(data_merged['Work Characteristics'] != 'Totaal') & (data_merged['Signed UW'] != 'Totaal') & (data_merged['Region'] != 'Nederland') & (data_merged['Work Characteristics'] != 'Totaal') ]

In [94]:
def missing_values_table(df): 
        mis_val = df.isnull().sum()
        mis_val_percent = 100 * df.isnull().sum()/len(df)
        mis_val_table = pd.concat([mis_val, mis_val_percent], axis=1)
        mis_val_table = mis_val_table.rename(columns = {0 : 'Missing Values', 1 : '% of Total Values'})
        return mis_val_table

In [95]:
missing = missing_values_table(data_filtered)
missing = missing[missing['Missing Values'] > 0] #showing only all those are not zero
print(missing)

                      Missing Values  % of Total Values
Work Characteristics          403536          78.005103
Payment                        11496           2.222222

In [106]:
data_filtered = data_filtered[data_filtered['Work Characteristics'].notnull()]

In [107]:
data_filtered.to_csv('labor-market-netherlands-dutch.csv')

---

In [13]:
table0 = pd.read_csv('../datasets/labor-market-netherlands.csv', sep =';', index_col=False)

/Users/pedrohserrano/anaconda3/envs/py35r/lib/python3.5/site-packages/IPython/core/interactiveshell.py:2728: DtypeWarning: Columns (1,2,3) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [7]:
table2 = pd.read_csv('../datasets/ParticipationEducation.csv', index_col=False)

In [8]:
table3 = pd.read_csv('../datasets/WorkCharacteristics.csv', index_col=False)

In [9]:
table4 = pd.read_csv('../datasets/Payment.csv', index_col=False)

In [10]:
table5 = pd.read_csv('../datasets/SignedUWV.csv', index_col=False)

In [11]:
table6 = pd.read_csv('../datasets/regionsNed.csv', index_col=False)

In [12]:
table7 = pd.read_csv('../datasets/Perioden.csv', index_col=False)

In [15]:
table0.head()

,ID,Participation in education,features Work,Payment,Signed CWI,REGIOS,The period,Youth 15 to 27 Years
0,0,T001144,T001095,T000000,T001266,NL01,2005JJ00,2351600
1,1,T001144,T001095,T000000,T001266,NL01,2006JJ00,2363600
2,2,T001144,T001095,T000000,T001266,NL01,2007JJ00,2374000
3,3,T001144,T001095,T000000,T001266,NL01,2008JJ00,2392100
4,4,T001144,T001095,T000000,T001266,NL01,2009JJ00,2418600

In [16]:
merged_1 = pd.merge(table0, table2, left_on='Participation in education', right_on= 'Key', how='left')

In [17]:
merged_2 = pd.merge(merged_1, table3, left_on='features Work', right_on= 'Key', how='left')

In [18]:
merged_3 = pd.merge(merged_2, table4, left_on='Payment', right_on= 'Key', how='left')

In [19]:
merged_4 = pd.merge(merged_3, table5, left_on='Signed CWI', right_on= 'Key', how='left')

In [20]:
merged_5 = pd.merge(merged_4, table6, left_on='REGIOS', right_on= 'Key', how='left')

In [21]:
merged_6 = pd.merge(merged_5, table7, left_on='The period', right_on= 'Key', how='left')

In [25]:
merged_6.columns#.columns

Index(['ID', 'Participation in education', 'features Work', 'Payment',
       'Signed CWI', 'REGIOS', 'The period', 'Youth 15 to 27 Years',
       'Description_x', 'Key_x', 'Title_x', 'Description_y', 'Key_y',
       'Title_y', 'Description_x', 'Key_x', 'Title_x', 'Description_y',
       'Key_y', 'Title_y', 'Description_x', 'Key_x', 'Title_x', 'Unnamed: 0',
       'Description_y', 'Key_y', 'Status', 'Title_y'],
      dtype='object')

In [27]:
merged_6.columns = ['ID', 'Participation in education key', 'features Work key', 'Payment key',
       'Signed CWI key', 'REGIOS key', 'The period key', 'Youth 15 to 27 Years',
                    'Description_1', 'Key_1', 'Participation in education',
                    'Description_2', 'Key_2', 'Work Characteristics',
                    'Description_3', 'Key_3', 'Payment', 
                    'Description_4', 'Key_4', 'Signed UW',
                    'Description_5', 'Key_5', 'Region', 'idtime','Description_6',
       'Key_6', 'Status', 'Period']

In [30]:
data_merged = merged_6[['ID','Work Characteristics','Payment','Signed UW','Region','Period','Youth 15 to 27 Years']]

In [34]:
data_merged.to_csv('../../labor-market-netherlands-english.csv', index=False)

In [93]:
data_filtered = data_merged[(data_merged['Work Characteristics'] != 'Totaal') & (data_merged['Signed UW'] != 'Totaal') & (data_merged['Region'] != 'Nederland') & (data_merged['Work Characteristics'] != 'Totaal') ]